## How to import data

In [2]:
#for a csv, comma separated values you can use pandas
import pandas as pd
data = pd.read_csv('Popular_Baby_Names.csv')
data.head()

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,FEMALE,HISPANIC,GERALDINE,13,75
1,2011,MALE,ASIAN AND PACIFIC ISLANDER,VINCENT,71,13
2,2011,MALE,ASIAN AND PACIFIC ISLANDER,VICTOR,17,49
3,2011,MALE,ASIAN AND PACIFIC ISLANDER,TYLER,31,35
4,2011,MALE,ASIAN AND PACIFIC ISLANDER,TRAVIS,11,55

In [4]:
#check the raw format inside a csv
with open('Popular_Baby_Names.csv') as f:
    lines=f.readlines()
lines[:10]

["Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank\n",
 '2011,FEMALE,HISPANIC,GERALDINE,13,75\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,VINCENT,71,13\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,VICTOR,17,49\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,TYLER,31,35\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,TRAVIS,11,55\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,TONY,16,50\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,TIMOTHY,16,50\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,THOMAS,18,48\n',
 '2011,MALE,ASIAN AND PACIFIC ISLANDER,TERRY,11,55\n']

##Different raw data format, our target is to transit needed data to pd acceptable format

In [5]:
#If there's space separate
#check the raw format inside a csv
with open('Popular_Baby_Names_space') as f:
    lines=f.readlines()
lines[:10]

["Year_of_Birth Gender Ethnicity Child's_First_Name Count Rank\n",
 '2011 FEMALE HISPANIC GERALDINE 13 75\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER VINCENT 71 13\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER VICTOR 17 49\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER TYLER 31 35\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER TRAVIS 11 55\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER TONY 16 50\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER TIMOTHY 16 50\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER THOMAS 18 48\n',
 '2011 MALE ASIAN AND PACIFIC ISLANDER TERRY 11 55\n']

In [10]:
pd.DataFrame([x.split()[0:3] for x in lines[1:10]], columns=lines[0].split()[0:3])

  Year_of_Birth  Gender Ethnicity
0          2011  FEMALE  HISPANIC
1          2011    MALE     ASIAN
2          2011    MALE     ASIAN
3          2011    MALE     ASIAN
4          2011    MALE     ASIAN
5          2011    MALE     ASIAN
6          2011    MALE     ASIAN
7          2011    MALE     ASIAN
8          2011    MALE     ASIAN